{
  "recipes": [
    {
      "id": 1,
      "ingredients": [
        "2 lbs New York Strip Steaks",
        "1/2 Tbsp vegetable oil",
        "1 tsp sea salt",
        "1 tsp black pepper, freshly ground",
        "2 Tbsp unsalted butter",
        "2 cloves garlic, peeled and quartered",
        "1 sprig fresh rosemary"
      ],
      "recipe": [
        "1. Pat dry:  use paper towels to pat the steaks dry to get a perfect sear and reduce oil splatter.",
        "2. Season generously: just before cooking steaks, sprinkle both sides liberally with salt and pepper.",
        "3. Preheat the pan on medium and brush with oil. Using just 1/2 Tbsp oil reduces splatter.",
        "4. Sear steaks: add steaks and sear each side 3-4 minutes until a brown crust has formed then use tongs to turn steaks on their sides and sear edges (1 min per edge).",
        "5. Add butter and aromatics: melt in butter with quartered garlic cloves and rosemary sprigs. Tilt pan to spoon garlic butter over steaks and cook to your desired doneness (see chart below)",
        "6. Remove steak and rest 10 minutes before slicing against the grain."
      ],
      "allergens": [
        false,
        false,
        false,
        true,
        false,
        false,
        false
      ],
      "image": "https://natashaskitchen.com/wp-content/uploads/2020/03/Pan-Seared-Steak-4-728x1092.jpg",
      "name": "Pan Seared Steak with Garlic Butter"
    },
    {
      "id": 2,
      "ingredients": [
        "white corn tortillas",
        "1 1/2 lb tilapia",
        "1/2 tsp ground cumin",
        "1/2 tsp cayenne pepper",
        "1 tsp salt",
        "1/4 tsp black pepper",
        "1 Tbsp Olive oil",
        "1 Tbsp unsalted butter"
      ],
      "recipe": [
        "1. Line large baking sheet with parchment or silicone liner. In a small dish, combine seasonings: 1/2 tsp cumin, 1/2 tsp cayenne pepper, 1 tsp salt and 1/4 tsp black pepper and evenly sprinkle seasoning mix over both sides of tilapia.",
        "2. Lightly drizzle fish with olive oil and dot each piece with butter. Bake at 375 for 20-25 min. To brown edges, broil for 3-5 minutes at the end if desired. ",
        "3. Combine all Taco sauce ingredients in a medium bowl and whisk until well blended.",
        "4. To serve the tacos, toast quickly toast the corn tortillas on a large dry skillet or griddle over medium/high heat.",
        "5. To assemble: start with pieces of fish then add remaining ingredients finishing with a generous sprinkle of cotija cheese and finally that awesome taco sauce! Serve with a fresh lime wedge to squeeze over tacos"
      ],
      "allergens": [
        false,
        true,
        false,
        true,
        false,
        true,
        false
      ],
      "image": "https://natashaskitchen.com/wp-content/uploads/2017/08/Easy-Fish-Tacos-with-the-Best-Fish-Taco-Sauce-4.jpg",
      "name": "Fish Taco"
    },
    {
      "id": 3,
      "ingredients": [
        "2 slices sandwich bread",
        "2 tablespoons peanut butter",
        "2 teaspoons grape jelly or 2 teaspoons strawberry jam"
      ],
      "recipe": [
        "1. Spread the peanut butter on one piece of bread.",
        "2. Spread the jelly on the other side.",
        "3. Put the two pieces of bread together to form a sandwich."
      ],
      "allergens": [
        true,
        false,
        false,
        false,
        false,
        true,
        false
      ],
      "image": "https://storcpdkenticomedia.blob.core.windows.net/media/recipemanagementsystem/media/recipe-media-files/recipes/retail/desktopimages/2018_grilled-peanut-butter-and-jelly_20336_600x600.jpg?ext=.jpg",
      "name": "Peanut Butter and Jelly Sandwich"
    },
    {
      "id": 4,
      "ingredients": [
        "12 oz linguine pasta",
        "2 tbsp Olive oil",
        "6 cloves garlic",
        "20 large raw uncooked shrimp",
        "1 tsp salt",
        "½ tsp pepper",
        "½ tsp thyme",
        "½ oregano",
        "2 tbsp unsalted butter",
        "1 cup low sodium vegetable broth",
        "1 ½ cup heavy cream",
        "1 cup grated parmesan cheese",
        "¼ cup parsely"
      ],
      "recipe": [
        "Add olive oil to a wide based pan. Heat the pan on the stove-top over medium heat.",
        "Next, add the shrimp and season with salt, pepper, thyme and oregano. When the shrimp turn pink, remove from the pan and set aside.",
        "Add butter to the same pan you used to cook the shrimp. Follow that by adding garlic and sauté the garlic until it is soft and fragrant.",
        "Add in broth, heavy cream and shredded parmesan cheese. Combine these ingredients using a whisk to develop the Alfredo sauce.",
        "Allow the sauce to bubble and thicken.",
        "Put the cooked shrimp back in the pan, followed by the cooked pasta. Lastly, add the parsley and mix everything together.",
        "Serve hot with a sprinkle of parmesan and fresh herbs!"
      ],
      "allergens": [
        false,
        false,
        true,
        true,
        false,
        true,
        true
      ],
      "image": "https://www.fooddolls.com/wp-content/uploads/2022/01/DSC00603-1-dragged.jpg",
      "name": "Shrimp Linguine Alfredo"
    },
    {
      "id": 5,
      "ingredients": [
        "Salmon sushi",
        "1 cup all-purpose flour",
        "Sparklingly water",
        "Salt",
        "Vegetable oil"
      ],
      "recipe": [
        "1. To make the tempura batter, combine the flour, salt and sparkling water in a bowl and whisk until smooth.",
        "2. Heat a large skillet or wok over medium-high heat and add enough oil to coat the bottom.",
        "3. Dip each piece of salmon sushi into the tempura batter, making sure to coat evenly.",
        "4. Carefully place the salmon sushi in the hot oil and fry for 2-3 minutes per side, or until crispy and golden brown.",
        "5. Remove from the oil and place on a paper towel-lined plate to absorb any excess oil.",
        "6. Serve with pickled ginger, wasabi, and soy sauce on the side for dipping. Enjoy!"
      ],
      "allergens": [
        false,
        true,
        false,
        false,
        false,
        true,
        false
      ],
      "image": "https://theflexiblefridge.com/wp-content/uploads/2022/09/IMG_6314-683x1024.jpg",
      "name": "Salmon Tempura Roll"
    },
    {
      "id": 6,
      "ingredients": [
        "4 (6-ounce) salmon fillets or a large 1 ½ pound fillet, wild caught if possible",
        "Olive oil, for brushing",
        "½ teaspoon kosher salt, plus more for brining",
        "½ teaspoon freshly ground black pepper",
        "3 tablespoons basil pesto (homemade preferable)",
        "1 tablespoon toasted and chopped pine nuts",
        "A few grates of lemon zest, for garnish"
      ],
      "recipe": [
        "1. Preheat the oven to 325 degrees Fahrenheit.",
        "2. Brine the salmon: While the oven preheats, in a shallow dish stir together 4 cups room temperature water and 3 tablespoons kosher salt until it dissolves. Place the salmon in the water and wait for 15 minutes (this should be about the time it takes to preheat).",
        "3. Bake*: Rub the bottom of a baking dish with olive oil. Pat each piece of salmon dry and place it on the pan. Sprinkle the salmon with ⅛ teaspoon kosher salt for each of the 4 fillets and fresh ground pepper. Cover pan with foil and bake the salmon for 10 minutes. Then remove the foil bake again for 3 to 6 minutes, depending on thickness, until just tender and pink at the center (the internal temperature should be between 125 to 130 degrees Fahrenheit in the center). A 1-inch thick fillet should cook in about 15 minutes total.",
        "4. Serve: When the salmon is done, spoon the pesto over the salmon. Sprinkle it with chopped pine nuts and if desired, a bit of lemon zest. Serve immediately. (Leftovers can be stored refrigerated for 3 to 4 days.)"
      ],
      "allergens": [
        true,
        true,
        false,
        false,
        false,
        false,
        false
      ],
      "image": "https://www.acouplecooks.com/wp-content/uploads/2020/08/Pesto-Salmon-008.jpg",
      "name": "Pesto Baked Salmon"
    },
    {
      "id": 7,
      "ingredients": [
        "4 slices brioche bread, about 3/4 to 1 thick",
        "4 tablespoons Nutella",
        "1 egg",
        "1/2 cup whole milk (or half and half)",
        "1 tablespoon sugar",
        "1 teaspoon vanilla extract",
        "1 tablespoon butter",
        "Powdered sugar, for dusting",
        "Berries, for garnishing"
      ],
      "recipe": [
        "1. Spread Nutella in each of the 4 pieces of bread and join them, 2 by 2, like sandwiches.",
        "2. In a shallow bowl, whisk the egg, milk, sugar and vanilla extract until well combined.",
        "3. Dip each sandwich into the custard, letting it saturate on both sides.",
        "4. Preheat a large skillet over medium high heat. Spray with cooking spray and add the butter, swirling the pan to coat the bottom. Once the butter is melted, add the French toasts and cook each side until golden brown (about 1-2 minutes per side).",
        "5. Dust the Nutella French toasts with powdered sugar, top with berries and serve."
      ],
      "allergens": [
        true,
        false,
        false,
        true,
        false,
        true,
        true
      ],
      "image": "https://www.oliviascuisine.com/wp-content/uploads/2019/01/nutella-french-toast.jpg",
      "name": "Nutella French Toast"
    },
    {
      "id": 8,
      "ingredients": [
        "2 tbsp red curry paste",
        "3/4 cup (180g) natural peanut butter, smooth",
        "1/4 cup (50g) white sugar",
        "2 tsp dark soy sauce",
        "1 tsp salt",
        "2 tbsp cider vinegar",
        "3/4 cup (185ml) water",
        "14oz coconut milk (1 can)",
        "Bamboo skewers",
        "1 tbsp curry powder",
        "1 tsp white sugar",
        "2 tsp red curry paste",
        "1 tsp salt"
      ],
      "recipe": [
        "1. Mix together the chicken and Marinade with 1/4 cup of coconut milk, then set aside for at least 20 minutes, or overnight.",
        "2. Thread onto skewers – I do 4 to 5 pieces each.",
        "3. Heat 1.5 tbsp oil in a large non stick pan over medium high heat.",
        "4. Cook skewers in batches for 3 minutes on each side until golden.",
        "5. Place remaining coconut milk and Peanut Sauce ingredients in a saucepan over medium low heat.",
        "6. Stir to combine then simmer, stirring every now and then, for 5 minutes.",
        "7. Adjust consistency with water – it should be a pourable but thickish sauce.",
        "8. Cover with lid and keep warm while cooking skewers."
      ],
      "allergens": [
        true,
        false,
        false,
        true,
        true,
        false,
        false
      ],
      "image": "https://www.recipetineats.com/wp-content/uploads/2019/03/Thai-Satay-Chicken_8.jpg?resize=650,910",
      "name": "Chicken Satay w Peanut Sauce"
    },
    {
      "id": 9,
      "ingredients": [
        "Salt",
        "2 large eggs and 2 large yolks, room temperature",
        "1 ounce (about ⅓ packed cup) grated pecorino Romano, plus additional for serving",
        "1 ounce (about ⅓ packed cup) grated Parmesan",
        "Coarsely ground black pepper",
        " 1 tablespoon olive oil",
        " 3½ ounces of slab guanciale (see recipe), pancetta or bacon, sliced into pieces about ¼ inch thick by ⅓ inch square",
        "12 ounces spaghetti (about ¾ box)"
      ],
      "recipe": [
        "1. Place a large pot of lightly salted water (no more than 1 tablespoon salt) over high heat, and bring to a boil. Fill a large bowl with hot water for serving, and set aside.",
        "2. In a mixing bowl, whisk together the eggs, yolks and pecorino and Parmesan. Season with a pinch of salt and generous black pepper.",
        "3. Let the water to boil. Meanwhile, heat oil in a large skillet over medium heat, add the pork, and sauté until the fat just renders, on the edge of crispness but not hard. Remove from heat and set aside.",
        "4. Add pasta to the water and boil until a bit firmer than al dente. Just before pasta is ready, reheat guanciale in skillet, if needed. Reserve 1 cup of pasta water, then drain pasta and add to the skillet over low heat. Stir for a minute or so.",
        "5. Empty serving bowl of hot water. Dry it and add hot pasta mixture. Stir in cheese mixture, adding some reserved pasta water if needed for creaminess. Serve immediately, dressing it with a bit of additional grated pecorino and pepper."
      ],
      "allergens": [
        false,
        false,
        false,
        true,
        false,
        true,
        true
      ],
      "image": "https://bellyfull.net/wp-content/uploads/2023/02/Spaghetti-Carbonara-blog-1.jpg",
      "name": "Carbonara"
    },
    {
      "id": 10,
      "ingredients": [
        " 1 9 inch prepared pie crust",
        " 1 tablespoon olive oil",
        " 4 eggs",
        " 1 cup milk",
        " 1 cup shredded sharp cheddar",
        " 2 cloves garlic clove minced",
        " ½ teaspoon oregano",
        " ½ teaspoon salt",
        " ½ teaspoon freshly cracked black pepper",
        " 4 cups small chopped broccoli florets"
      ],
      "recipe": [
        "1. Line a pie pan with the pie crust. Press gently to fill the corners and extend the crust all the way to the edge. Crimp the edge. Prick the base with a fork several times and freeze for 20 minutes.",
        "2. Preheat oven to 375° F. Line the crust with parchment and fill with baking weights, rice or dry beans. Bake for 12 minutes.",
        "3. Remove the parchment and weights and bake for another 10 minutes until barely starting to brown on the edges.",
        "4. In a large bowl, whisk together the eggs and milk. Add the cheese, garlic, oregano, salt, pepper and chopped broccoli. Stir to combine.",
        "5. In the partially baked crust, transfer the custard and broccoli mixture in an even layer.",
        "6. Bake for 35-40 minutes until the crust on the edge is brown and the center is just set.",
        "7. Serve warm or at room temperature."
      ],
      "allergens": [
        false,
        false,
        false,
        true,
        false,
        true,
        true
      ],
      "image": "https://feelgoodfoodie.net/wp-content/uploads/2020/12/Broccoli-and-Cheese-Quiche-9-1024x1536.jpg",
      "name": "Brocoli and Cheese Quiche"
    },
    {
      "id": 11,
      "ingredients": [
        "4 tbsp olive oil",
        "400g pork leg, cut into chunks",
        "2 garlic cloves, sliced",
        "1 onion, finely chopped",
        "200g chorizo sausage, cut into small pieces",
        "400g paella rice",
        "1 tbsp smoked paprika ",
        "400g can cherry tomato",
        "1l hot vegetable stock",
        "200g bag baby spinach",
        "200g clam, cleaned"
      ],
      "recipe": [
        "1. Heat half the olive oil in a paella pan or a large frying pan. Tip in the pork and cook for about 5 mins until lightly browned, but not cooked through. Remove from the pan, then set aside on a plate. Pour the remaining olive oil into the pan, then add in the onion, garlic and chorizo. Cook for about 5 mins until the onion is softened and the chorizo is starting to crisp and give off its oil.",
        "2. Add the rice and paprika to the pan, then stir around for 1-2 mins until all the grains of rice are well coated. Can be prepared up to this point 1 day in advance and stored in the fridge.",
        "3. Pour the tomatoes and any juices into the pan along with the pork and 900ml of the vegetable stock. Bring to the boil, reduce the heat, then let it gently simmer for about 20 mins until the rice is nearly soft. Place the spinach in a sieve, then pour over a kettle of boiling water so the leaves are just wilted. Arrange the spinach leaves in the pan along with the clams. Pour over the remaining 100ml vegetable stock, then cook for another 10 mins. By this time the clams should have opened (discard any that haven’t) and the rice should be tender. Serve straight away from the pan"
      ],
      "allergens": [
        false,
        true,
        false,
        false,
        false,
        true,
        false
      ],
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-411594_11-da3025b.jpg",
      "name": "Spicy Clam and Pork Paella"
    },
    {
      "id": 12,
      "ingredients": [
        "200g linguine",
        "2-3 fat garlic clove, finely chopped",
        "50g butter",
        "175g pack raw shelled king prawns, de-veined and split in half lengthways",
        "finely grated zest 1 lemon, then cut the lemon into wedges",
        "small pack parsley, chopped"
      ],
      "recipe": [
        "1. Boil the pasta following pack instructions. Meanwhile, very gently cook the garlic in the butter in a medium pan until softened. Add the prawns and cook until they just turn from grey to pink. It is important not to overcook them or they will be tough. Remove from the heat and stir in the zest and seasoning.",
        "2. Drain the pasta and toss into the pan with the prawn mixture and parsley until well mixed. Divide between two bowls and serve with the lemon wedges."
      ],
      "allergens": [
        false,
        true,
        false,
        false,
        false,
        true,
        false
      ],
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/linguine-with-garlic-butter-prawns-d79972f.jpg?quality=90&webp=true&resize=300,272",
      "name": "Linguine with Garlic Butter Prawns"
    },
    {
      "id": 13,
      "ingredients": [
        "Kosher salt",
        "Vegetable oil",
        "1 pound cavatappi or elbow macaroni",
        "1 quart milk",
        "8 tablespoons (1 stick) unsalted butter, divided",
        "1/2 cup all-purpose flour",
        "12 ounces Gruyere cheese, grated (4 cups)",
        "8 ounces extra-sharp Cheddar, grated (2 cups)",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon nutmeg",
        "1 1/2 pounds cooked lobster meat",
        "1 1/2 cups fresh white bread crumbs"
      ],
      "recipe": [
        "1. Preheat the oven to 375 degrees F.",
        "2. Drizzle oil into a large pot of boiling salted water. Add the pasta and cook according to the directions on the package, 6 to 8 minutes. Drain well.",
        "3. Meanwhile, heat the milk in a small saucepan, but don't boil it. In a large pot, melt 6 tablespoons of butter and add the flour. Cook over low heat for 2 minutes, stirring with a whisk. Still whisking, add the hot milk and cook for a minute or two more, until thickened and smooth. Off the heat, add the Gruyere, Cheddar, 1 tablespoon salt, the pepper, and nutmeg. Add the cooked macaroni and lobster and stir well. Place the mixture in 6 to 8 individual gratin dishes.",
        "4. Melt the remaining 2 tablespoons of butter, combine them with the fresh bread crumbs, and sprinkle on the top. Bake for 30 to 35 minutes, or until the sauce is bubbly and the macaroni is browned on the top."
      ],
      "allergens": [
        false,
        false,
        true,
        true,
        false,
        true,
        false
      ],
      "image": "https://www.dinneratthezoo.com/wp-content/uploads/2019/04/lobster-mac-and-cheese-6.jpg",
      "name": "Lobster Mac and Cheese"
    },
    {
      "id": 14,
      "ingredients": [
        "2 and 3/4 cups (344g) all-purpose flour",
        "1/4 cup (50g) granulated sugar",
        "1/2 teaspoon salt",
        "3/4 cup (180ml) whole milk",
        "3 Tablespoons (45g) unsalted butter",
        "2 and 1/4 teaspoons Platinum Yeast from Red Star or any instant yeast (1 standard packet)",
        "1 large egg, at room temperature",
        "3 Tablespoons (45g) unsalted butter, extra softened",
        "1/3 cup (67g) packed light or dark brown sugar",
        "1 Tablespoon ground cinnamon",
        "full-fat block cream cheese, softened to room temperature",
        "2 Tablespoons (30g) butter, softened to room temperature",
        "2/3 cup (80g) confectioner sugar",
        "1 teaspoon pure vanilla extract"
      ],
      "recipe": [
        "1.Make the dough: Whisk the flour, sugar, and salt together in a large bowl. Set aside.",
        "2. Combine the milk and butter together in a heatproof bowl. Microwave or use the stove and heat until the butter has melted and the mixture is warm to the touch (about 110°F/43°C, no higher). Whisk in the yeast until it has dissolved. Pour mixture into the dry ingredients, add the egg, and stir with a sturdy rubber spatula or wooden spoon OR use a stand mixer with a paddle attachment on medium speed. Mix until a soft dough forms.",
        "3. Transfer dough to a lightly floured surface. Using floured hands, knead the dough for 3 minutes. You should have a smooth ball of dough. If the dough is super soft or sticky, you can add a little more flour. Place in a lightly greased bowl (I use non-stick spray), cover loosely, and let the dough rest for about 10 minutes as you get the filling ingredients ready.",
        "4. Fill the rolls: After 10 minutes, roll the dough out in a 14×8-inch (36×20-cm) rectangle. Spread the softened butter on top. Mix together the cinnamon and brown sugar. Sprinkle it all over the dough. Roll up the dough to make a 14-inch log. Cut into 10–12 even rolls and arrange in a lightly greased 9- or 10-inch round cake pan, pie dish, or square baking pan.",
        "5. Rise: Cover the pan with aluminum foil, plastic wrap, or a clean kitchen towel. Allow the rolls to rise in a relatively warm environment for 60–90 minutes or until double in size.",
        "6. Bake the rolls: After the rolls have doubled in size, preheat the oven to 375°F (190°C). Bake for 24–27 minutes, or until lightly browned.",
        "7. Icing time"
      ],
      "allergens": [
        false,
        false,
        false,
        true,
        false,
        true,
        true
      ],
      "image": "https://sallysbakingaddiction.com/wp-content/uploads/2013/05/easy-cinnamon-rolls-with-cream-cheese-frosting-1024x1536.jpg",
      "name": "Cinnamon Rolls"
    },
    {
      "id": 15,
      "ingredients": [
        "16 oz (450 g) firm tofu, pressed",
        "2 Tbsp (16 g) cornstarch ",
        "1 Tbsp (15 mL) vegetable oil",
        "½ tsp salt",
        "¼ tsp ground black pepper"
      ],
      "recipe": [
        "1. Ensure the tofu is sufficiently pressed before cutting it into 1 cm cubes*.",
        "2. Add the tofu cubes to a large bowl, along with the cornstarch, oil, salt, and pepper. Gently toss to coat.",
        "3. Heat up a large pan over high heat and add the tofu, cook until golden on all sides, about 10 minutes. Try to not disturb the tofu too much to avoid crumbling.",
        "4. Meanwhile, mix all the sauce ingredients in a small bowl. Set aside.",
        "5. When the tofu is crisped to your liking, transfer it to a plate. Return the same pan to the heat, and add the oil. When hot, add the garlic, shallot, chilis, and green onion. Cook for 4 - 5 minutes.",
        "6. Reduce the heat to medium-high and add the sauce, cooking for another 4 - 5 minutes or until the sauce becomes sticky.",
        "7. Add the tofu to the pan, and stir to coat. Garnish, serve, and enjoy!"
      ],
      "allergens": [
        false,
        false,
        false,
        false,
        true,
        false,
        false
      ],
      "image": "https://cdn.pickuplimes.com/cache/2f/92/2f92995926d24418402cff4847593bc7.jpg",
      "name": "Spicy Garlic Tofu"
    },
    {
      "id": 16,
      "ingredients": [
        "1 12-ounce bag frozen shelled edamame",
        "1 large carrot, peeled",
        "4 teaspoons toasted sesame oil",
        "1 tablespoon rice vinegar",
        "2 teaspoons soy sauce",
        "2 teaspoons maple syrup",
        "1 teaspoon minced fresh ginger OR 1/2 teaspoon ground ginger"
      ],
      "recipe": [
        "1. Prepare the edamame according to package directions until tender; drain and rinse under cold water. Transfer to a clean dish towel to pat dry and then place in a large bowl. Refrigerate while preparing the other elements.",
        "2. Using a vegetable peeler, cut the carrot into ribbon strips. For extra crispness, place in a bowl of ice water until ready to use.",
        "3. In a small jar, shake together the sesame oil, vinegar, soy sauce, maple syrup, ginger and optional chile until blended.",
        "4. When ready to serve, drain and pat the carrot ribbons dry. Add to the bowl of edamame along with the lettuce, cucumber, avocado and cilantro. Add the dressing, gently tossing to coat. Season to taste with salt & pepper.",
        "5. If desired, sprinkle with sesame seeds."
      ],
      "allergens": [
        false,
        false,
        false,
        false,
        true,
        false,
        false
      ],
      "image": "https://www.powerhungry.com/wp-content/uploads/2012/05/edamame-salad-2-720x721.png",
      "name": "Sesame-Ginger Edamame Carrot Salad"
    },
    {
      "id": 17,
      "ingredients": [
        "5 medium sized Roma tomatoes, roughly chopped",
        "1 red bell pepper, roughly chopped",
        "1 medium sized onion, roughly chopped, set aside",
        "2 scotch bonnet peppers (habanero peppers as they are sometimes called)",
        "1/4 cup of groundnut oil",
        "3 tbsp tomato paste",
        "2 cups of parboiled rice",
        "2 1/2 cups of chicken stock",
        "1 tsp salt to taste",
        "1/2 tsp curry powder",
        "1/2 tsp thyme",
        "1 tsp All purpose seasoning",
        "1 Knorr stock cube",
        "3 bay leaves",
        "Water, as needed"
      ],
      "recipe": [
        "1. Blend your tomatoes, red pepper, scotch bonnet peppers in a food processor or blender for about 45 seconds, make sure that everything is blended well.",
        "2. In a medium sized pot, heat your oil on medium-high heat. Once the oil is heated add the onions you set aside and fry just until they turn golden brown. Once the onions, have turned brown in color add the tomato paste and fry for 2-3 minutes. Then add the blended tomato mixture (reserve about 1/4 cup and set aside) and fry the mixture with the onions and tomato paste for about 30 minutes. Make sure you stir consistently so that the tomato mixture does not burn.",
        "3. After 30 minutes, turn the heat down to medium, and add the chicken stock. Mix and add your seasonings (salt, curry powder, thyme, all purpose seasoning, and the Knorr stock cube). Continue to boil for 10 minutes.",
        "4. Add the parboiled rice to the pot. Mix it very well with the tomato stew. At this point if you need to add water so that the rice is level with the tomato mixture/chicken stock go ahead and do so. Add the bay leaves, cover the pot, and cook on medium to low heat for 15-30 minutes.",
        "5. When the liquid has almost dried up add the remaining tomato stew, cover, and let it cook for another 5-10 minutes heat until the liquid has completely dried up. Turn off the heat, mix thoroughly, and your Jollof Rice is ready to be eaten!"
      ],
      "allergens": [
        true,
        false,
        false,
        false,
        false,
        true,
        false
      ],
      "image": "https://i0.wp.com/evseats.com/wp-content/uploads/2015/08/How-To-Make-Jollof-Rice-In-5-Easy-Steps-1.jpg?resize=820%2C1024&ssl=1",
      "name": "Jollof Rice"
    },
    {
      "id": 18,
      "ingredients": [
        "2 cups all purpose | plain flour, (290 g | 10 oz)",
        "1/4 cup granulated sugar or sweetener, (60g | 2 oz)",
        "4 teaspoons baking powder",
        "1/4 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 3/4 cups milk, (440ml) Water, as needed",
        "1/4 cup butter, (60g | 2 oz)",
        "2 teaspoons pure vanilla extract",
        "1 large egg"
      ],
      "recipe": [
        "1. Combine together the flour, sugar (or sweetener), baking powder, baking soda and salt in a large-sized bowl. Make a well in the centre and add the milk, slightly cooled melted butter, vanilla and egg.",
        "2. Use a wire whisk to whisk the wet ingredients together first before slowly folding them into the dry ingredients. Mix together until smooth (there may be a couple of lumps but that's okay). (The batter will be thick and creamy in consistency. If you find the batter too thick -- doesn't pour off the ladle or out of the measuring cup smoothly -- fold a couple tablespoons of extra milk into the batter at a time until reaching desired consistency).",
        "3. Set the batter aside and allow to rest while heating up your pan or griddle. ",
        "4. Heat a nonstick pan or griddle over low-medium heat and wipe over with a little butter to lightly grease pan. Pour ¼ cup of batter onto the pan and spread out gently into a round shape with the back of your ladle or measuring cup.",
        "5.  When the underside is golden and bubbles begin to appear on the surface, flip with a spatula and cook until golden. Repeat with remaining batter.",
        "6. Serve with honey, maple syrup, fruit, ice cream or frozen yoghurt, or enjoy plain!"
      ],
      "allergens": [
        false,
        false,
        false,
        true,
        false,
        false,
        true
      ],
      "image": "https://cafedelites.com/wp-content/uploads/2016/10/PERFECT-Best-Fluffy-Pancakes-IMAGE-450-1024x1536.jpg",
      "name": "Fluffy Pancakes"
    }
    
  ]
}